WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetUnsignedInt_Client_Request-0.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetUnsignedInt</a:Action>
    <a:MessageID>urn:uuid:ac286972-0aa2-4e08-87fe-f0d63697a398</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetUnsignedInt xmlns="http://tempuri.org/">
      <inUInt xmlns="">0</inUInt>
    </RetUnsignedInt>
  </s:Body>
</s:Envelope>